app/Controllers/login_Controller.php

   public function auth()
    {
        $session = session();
        $model = new usuario_Model();

        //traemos los datos del formulario
        $usuario = $this->request->getVar('usuario');
        $password = $this->request->getVar('pass');

        //se verifica si el usuario ingresado en el formulario coincide con el de la tabla en la bd
        $data = $model->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'bric'
 LIMIT 1